### Pandas
- 데이터 핸들링 라이브러리
- 스프레드시트형 데이터 핸들링 특징
- 데이터 프레임을 사용하여 데이터 가공을 도움

In [1]:
import numpy as np
import pandas as pd

In [6]:
data = pd.Series([85.3, 65, 76, 95], index=["국어", "영어", "수학", "과학"])
data

국어    85.3
영어    65.0
수학    76.0
과학    95.0
dtype: float64

In [10]:
# 자체 인덱스
data1 = pd.Series([85.3, 65, 76, 95])
data1

0    85.3
1    65.0
2    76.0
3    95.0
dtype: float64

In [9]:
# 인덱스 가져오기
data.index

Index(['국어', '영어', '수학', '과학'], dtype='object')

In [8]:
#값만 가져오기
data.values

array([85.3, 65. , 76. , 95. ])

In [21]:
data.name="성적표"
data.index.name = "과목"
#data.columns = ['과목', '성적']
data

과목
국어    85.3
영어    65.0
수학    76.0
과학    95.0
Name: 성적표, dtype: float64

In [17]:
# 스칼라 곱
data*10

과목
국어    853.0
영어    650.0
수학    760.0
과학    950.0
Name: 성적표, dtype: float64

In [29]:
# 데이터 프레임 생성
data = {"a":[80, 70, 55, 23], "b":[90, 75, 85, 83], "c":[50,55,85,83]}
idx=["국어", "영어", "수학", "과학"]
df = pd.DataFrame(data, index=idx)
df.index.name="과목"
df

     a   b   c
과목
국어  80  90  50
영어  70  75  55
수학  55  85  85
과학  23  83  83

In [37]:
#인덱싱
print(df['a']) # 칼럼으로 찾기
print("#"*30)
print(df.loc["국어"]) # 인덱스로 찾기
print("#"*30)
print(df.iloc[0]) # 인덱스 인덱스로 찾기
print("#"*30)
print(df.loc["국어"]["a"]) # 특정 위치 찾기
print("#"*30)
print(df.loc["국어"][1])

과목
국어    80
영어    70
수학    55
과학    23
Name: a, dtype: int64
##############################
a    80
b    90
c    50
Name: 국어, dtype: int64
##############################
a    80
b    90
c    50
Name: 국어, dtype: int64
##############################
80
##############################
90

In [41]:
# 행 추가
df.loc["음악"]=[77, 66, 55]
df

     a   b   c
과목
국어  80  90  50
영어  70  75  55
수학  55  85  85
과학  23  83  83
음악  77  66  55

In [46]:
# 열 추가: 시리즈 추가
df.loc[:, 'd'] = pd.Series([86,84,35,74,56], index=df.index)
df['e'] = pd.Series([65,74,45,84,66], index=df.index)
df

     a   b   c   d   e
과목
국어  80  90  50  86  65
영어  70  75  55  84  74
수학  55  85  85  35  45
과학  23  83  83  74  84
음악  77  66  55  56  66

In [47]:
#삭제
df.drop('c', axis=1)

     a   b   d   e
과목
국어  80  90  86  65
영어  70  75  84  74
수학  55  85  35  45
과학  23  83  74  84
음악  77  66  56  66

In [53]:
# 칼럼 추출
df1 = df.loc[:, ["a","b"]]
df1

     a   b
과목
국어  80  90
영어  70  75
수학  55  85
과학  23  83
음악  77  66

In [54]:
#행삭제
df.drop('영어', axis=0)

     a   b   c   d   e
과목
국어  80  90  50  86  65
수학  55  85  85  35  45
과학  23  83  83  74  84
음악  77  66  55  56  66

In [58]:
# 추출
df.loc["영어":"과학", ["a","b"]]

     a   b
과목
영어  70  75
수학  55  85
과학  23  83

In [59]:
# 슬라이싱
df.loc["영어":"과학","a":"b"]

     a   b
과목
영어  70  75
수학  55  85
과학  23  83

In [60]:
# 열추가
df.loc["영어":"과학","a":"b"]

     a   b
과목
영어  70  75
수학  55  85
과학  23  83